99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_future.c
#include "esp32_mquickjs_wifi.h"
#include "esp32_mquickjs_memory.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_wireless_core.h"

#include <inttypes.h>
#include <math.h>
#include <stdio.h>
#include <string.h>

#include "esp_heap_caps.h"
#include "esp_wifi.h"
#include "esp_timer.h"

typedef enum {
    WIFI_FUTURE_SCAN,
    WIFI_FUTURE_CONNECT,
    WIFI_FUTURE_DISCONNECT,
} wifi_future_kind_t;

static const char *wifi_future_operation_name(wifi_future_kind_t kind)
{
    return kind == WIFI_FUTURE_SCAN
               ? "wifi.scan"
               : kind == WIFI_FUTURE_CONNECT ? "wifi.connect"
                                             : "wifi.disconnect";
}

struct esp32_mquickjs_future_driver_state {
    wifi_future_kind_t kind;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    uint32_t generation;
    uint32_t timeout_ms;
    uint32_t scan_status;
    uint32_t connect_kind;
    int32_t connect_reason;
    uint64_t connect_start_us;
    uint64_t connect_completed_us;
    esp32_mquickjs_wifi_link_snapshot_t connect_link;
    wifi_scan_config_t scan_config;
    uint8_t scan_ssid[33];
    uint8_t scan_bssid[6];
    uint16_t scan_max_records;
    wifi_config_t connect_config;
    bool started;
    bool completed;
    bool cancel_requested;
};

static bool wifi_is_object(JSContext *ctx, JSValue value)
{
    return JS_GetClassID(ctx, value) >= 0 && !JS_IsArray(ctx, value);
}

static bool wifi_string_equals(JSContext *ctx, JSValue value,
                               const char *expected)
{
    JSCStringBuf buffer;
    const char *text;
    size_t length;

    return JS_IsString(ctx, value) &&
           (text = JS_ToCStringLen(ctx, &length, value, &buffer)) != NULL &&
           length == strlen(expected) && memcmp(text, expected, length) == 0;
}

static bool wifi_validate_option_keys(JSContext *ctx, JSValue options,
                                      const char *api_name,
                                      const char *const *allowed,
                                      size_t allowed_count)
{
    return esp32_mquickjs_validate_plain_options(
        ctx, options, api_name, allowed, allowed_count);
}

static bool wifi_to_integer(JSContext *ctx, JSValue value,
                            int32_t minimum, int32_t maximum,
                            int32_t *out)
{
    double number;

    if (out == NULL || !JS_IsNumber(ctx, value) ||
        JS_ToNumber(ctx, &number, value) != 0 || !isfinite(number) ||
        floor(number) != number || number < minimum || number > maximum) {
        return false;
    }
    *out = (int32_t)number;
    return true;
}

static bool wifi_parse_bssid(JSContext *ctx, JSValue value,
                             uint8_t output[6])
{
    JSCStringBuf buffer;
    const char *text;
    size_t length;
    size_t index;

    if (!JS_IsString(ctx, value) ||
        (text = JS_ToCStringLen(ctx, &length, value, &buffer)) == NULL || length != 17) {
        return false;
    }
    for (index = 0; index < 6; ++index) {
        uint8_t byte = 0;
        if (index != 0 && text[index * 3 - 1] != ':') return false;
        for (size_t digit = 0; digit < 2; ++digit) {
            char c = text[index * 3 + digit];
            unsigned value;
            if (c >= '0' && c <= '9') value = c - '0';
            else if (c >= 'a' && c <= 'f') value = c - 'a' + 10;
            else if (c >= 'A' && c <= 'F') value = c - 'A' + 10;
            else return false;
            byte = (uint8_t)((byte << 4) | value);
        }
        output[index] = byte;
    }
    return true;
}

static bool wifi_parse_auth_mode(JSContext *ctx, JSValue value,
                                 wifi_auth_mode_t *out)
{
    if (wifi_string_equals(ctx, value, "open")) {
        *out = WIFI_AUTH_OPEN;
    } else if (wifi_string_equals(ctx, value, "wep")) {
        *out = WIFI_AUTH_WEP;
    } else if (wifi_string_equals(ctx, value, "wpa")) {
        *out = WIFI_AUTH_WPA_PSK;
    } else if (wifi_string_equals(ctx, value, "wpa2")) {
        *out = WIFI_AUTH_WPA2_PSK;
    } else if (wifi_string_equals(ctx, value, "wpa/wpa2")) {
        *out = WIFI_AUTH_WPA_WPA2_PSK;
    } else if (wifi_string_equals(ctx, value, "wpa3")) {
        *out = WIFI_AUTH_WPA3_PSK;
    } else if (wifi_string_equals(ctx, value, "wpa2/wpa3")) {
        *out = WIFI_AUTH_WPA2_WPA3_PSK;
    } else if (wifi_string_equals(ctx, value, "wapi")) {
        *out = WIFI_AUTH_WAPI_PSK;
    } else if (wifi_string_equals(ctx, value, "owe")) {
        *out = WIFI_AUTH_OWE;
    } else {
        return false;
    }
    return true;
}

static bool wifi_station_unsupported(JSContext *ctx, const char *option, const char *operation)
{
    if (strcmp(operation, "wifi.configure") == 0) {
        (void)esp32_mquickjs_wifi_throw_configuration_error(ctx, ESP_ERR_NOT_SUPPORTED, option, NULL);
        return false;
    }
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    *details = JS_NewObject(ctx);
    if (!JS_IsException(*details) &&
        esp32_mquickjs_set_property_ref(ctx, details, "option", JS_NewString(ctx, option)) &&
        esp32_mquickjs_set_property_ref(ctx, details, "espCode", JS_NewInt32(ctx, ESP_ERR_NOT_SUPPORTED)) &&
        esp32_mquickjs_set_property_ref(ctx, details, "espName", JS_NewString(ctx, esp_err_to_name(ESP_ERR_NOT_SUPPORTED)))) {
        (void)esp32_mquickjs_throw_native_error(ctx, "WIFI_CONNECT_UNSUPPORTED", operation,
            "requested station option is unavailable in this SDK/build", *details);
    }
    JS_PopGCRef(ctx, &details_ref);
    return false;
}

static bool wifi_parse_station_phy(JSContext *ctx, JSValue options, wifi_sta_config_t *sta, const char *operation)
{
    static const char *const names[] = {
        "heDcmSet", "heMcs9Enabled", "heSuBeamformeeDisabled",
        "heTrigSuBeamformingFeedbackDisabled", "heTrigMuBeamformingPartialFeedbackDisabled",
        "heTrigCqiFeedbackDisabled", "vhtSuBeamformeeDisabled",
        "vhtMuBeamformeeDisabled", "vhtMcs8Enabled",
    };
    static const char *const dcm_names[] = {"heDcmMaxConstellationTx", "heDcmMaxConstellationRx"};
    bool flags[9] = {0};
    uint32_t dcm[2] = {3, 3};
    bool dcm_present[2] = {false, false};
    bool ok = false;
    JSGCRef options_ref, value_ref;
    JSValue *root = JS_PushGCRef(ctx, &options_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *root = options;
    for (size_t i = 0; i < sizeof(names) / sizeof(names[0]); ++i) {
        *value = JS_GetPropertyStr(ctx, *root, names[i]);
        if (JS_IsException(*value)) goto done;
        if (JS_IsUndefined(*value)) continue;
        if (!JS_IsBool(*value)) goto invalid;
#if !CONFIG_SOC_WIFI_HE_SUPPORT
        if (i < 6) { wifi_station_unsupported(ctx, names[i], operation); goto done; }
#endif
        /* In the pinned SDK the 5 GHz target implements 802.11ac. This only
         * admits explicit PHY configuration; it does not enable a protocol. */
#if !CONFIG_SOC_WIFI_SUPPORT_5G
        if (i >= 6) { wifi_station_unsupported(ctx, names[i], operation); goto done; }
#endif
        flags[i] = *value == JS_TRUE;
    }
    for (size_t i = 0; i < 2; ++i) {
        *value = JS_GetPropertyStr(ctx, *root, dcm_names[i]);
        if (JS_IsException(*value)) goto done;
        dcm_present[i] = !JS_IsUndefined(*value);
        if (!dcm_present[i]) continue;
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 0, 3, &dcm[i])) goto invalid;
#if !CONFIG_SOC_WIFI_HE_SUPPORT
        wifi_station_unsupported(ctx, dcm_names[i], operation); goto done;
#endif
    }
    if ((dcm_present[0] || dcm_present[1]) && !flags[0]) {
        JS_ThrowTypeError(ctx, "explicit DCM constellation requires heDcmSet:true");
        goto done;
    }
    /* Bitfields cannot be addressed through offsetof or bool pointers. Parse
     * into local scalars before assigning, preserving every reserved bit. */
    sta->he_dcm_set = flags[0];
    sta->he_dcm_max_constellation_tx = flags[0] ? dcm[0] : 0;
    sta->he_dcm_max_constellation_rx = flags[0] ? dcm[1] : 0;
    sta->he_mcs9_enabled = flags[1];
    sta->he_su_beamformee_disabled = flags[2];
    sta->he_trig_su_bmforming_feedback_disabled = flags[3];
    sta->he_trig_mu_bmforming_partial_feedback_disabled = flags[4];
    sta->he_trig_cqi_feedback_disabled = flags[5];
    sta->vht_su_beamformee_disabled = flags[6];
    sta->vht_mu_beamformee_disabled = flags[7];
    sta->vht_mcs8_enabled = flags[8];
    ok = true;
    goto done;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid wifi.connect PHY option");
done:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return ok;
}

static bool wifi_parse_station_extensions(JSContext *ctx, JSValue options, wifi_sta_config_t *sta, const char *operation)
{
    static const char *const flag_names[] = {"rmEnabled", "btmEnabled", "mboEnabled", "ftEnabled", "oweEnabled",
                                           "transitionDisable", "disableWpa3CompatibleMode"};
    static const char *const pwe_names[] = {"hunting-and-pecking", "hash-to-element", "both"};
    static const wifi_sae_pwe_method_t pwe_values[] = {WPA3_SAE_PWE_HUNT_AND_PECK, WPA3_SAE_PWE_HASH_TO_ELEMENT, WPA3_SAE_PWE_BOTH};
    bool flag[7] = {0}, present[7] = {0};
    bool pwe_present = false, identifier_present = false;
    bool ok = false;
    JSGCRef options_ref, value_ref;
    JSValue *root = JS_PushGCRef(ctx, &options_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    *root = options;
    uint32_t number;
    *value = JS_GetPropertyStr(ctx, *root, "listenInterval");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 0, UINT16_MAX, &number)) goto invalid;
        sta->listen_interval = number;
    }
    *value = JS_GetPropertyStr(ctx, *root, "failureRetryCount");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 0, UINT8_MAX, &number)) goto invalid;
        if (number != 0 && sta->scan_method != WIFI_ALL_CHANNEL_SCAN) goto conflict;
        sta->failure_retry_cnt = number;
    }
    *value = JS_GetPropertyStr(ctx, *root, "rssi5gAdjustment");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *value, 0, UINT8_MAX, &number)) goto invalid;
#if !CONFIG_SOC_WIFI_SUPPORT_5G
        wifi_station_unsupported(ctx, "rssi5gAdjustment", operation); goto done;
#endif
        sta->threshold.rssi_5g_adjustment = number;
    }
    for (size_t i = 0; i < sizeof(flag_names) / sizeof(flag_names[0]); ++i) {
        *value = JS_GetPropertyStr(ctx, *root, flag_names[i]);
        if (JS_IsException(*value)) goto done;
        present[i] = !JS_IsUndefined(*value);
        if (present[i]) {
            if (!JS_IsBool(*value)) goto invalid;
            flag[i] = *value == JS_TRUE;
        }
    }
    if (sta->threshold.authmode == WIFI_AUTH_OWE) {
        if (present[4] && !flag[4]) goto conflict;
        flag[4] = true;
    }
    if (flag[2]) {
        if ((present[0] && !flag[0]) || (present[1] && !flag[1])) goto conflict;
        flag[0] = true; flag[1] = true; /* SDK MBO dependency, made explicit. */
    }
#if !CONFIG_ESP_WIFI_11KV_SUPPORT || !CONFIG_ESP_WIFI_RRM_SUPPORT
    if (flag[0]) { wifi_station_unsupported(ctx, "rmEnabled", operation); goto done; }
#endif
#if !CONFIG_ESP_WIFI_11KV_SUPPORT || !CONFIG_ESP_WIFI_WNM_SUPPORT
    if (flag[1]) { wifi_station_unsupported(ctx, "btmEnabled", operation); goto done; }
#endif
#if !CONFIG_ESP_WIFI_MBO_SUPPORT
    if (flag[2]) { wifi_station_unsupported(ctx, "mboEnabled", operation); goto done; }
#endif
#if !CONFIG_ESP_WIFI_11R_SUPPORT
    if (flag[3]) { wifi_station_unsupported(ctx, "ftEnabled", operation); goto done; }
#endif
#if !CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA
    if (flag[4]) { wifi_station_unsupported(ctx, "oweEnabled", operation); goto done; }
#endif
#if !CONFIG_ESP_WIFI_ENABLE_WPA3_SAE && !CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA
    if (flag[5]) { wifi_station_unsupported(ctx, "transitionDisable", operation); goto done; }
#endif
#if !CONFIG_ESP_WIFI_WPA3_COMPATIBLE_SUPPORT
    if (flag[6]) { wifi_station_unsupported(ctx, "disableWpa3CompatibleMode", operation); goto done; }
#endif
    if ((flag[1] || flag[2]) && (sta->bssid_set || sta->channel != 0)) goto conflict;
    sta->rm_enabled = flag[0]; sta->btm_enabled = flag[1]; sta->mbo_enabled = flag[2];
    sta->ft_enabled = flag[3]; sta->owe_enabled = flag[4];
    sta->transition_disable = flag[5];
    sta->disable_wpa3_compatible_mode = flag[6];

    *value = JS_GetPropertyStr(ctx, *root, "saePwe");
    if (JS_IsException(*value)) goto done;
    pwe_present = !JS_IsUndefined(*value);
    if (pwe_present) {
        size_t index;
        if (!esp32_mquickjs_value_to_enum(ctx, *value, pwe_names, 3, &index)) goto invalid;
        sta->sae_pwe_h2e = pwe_values[index];
#if !CONFIG_ESP_WIFI_ENABLE_WPA3_SAE
        wifi_station_unsupported(ctx, "saePwe", operation); goto done;
#endif
#if !CONFIG_ESP_WIFI_ENABLE_SAE_H2E
        if (sta->sae_pwe_h2e != WPA3_SAE_PWE_HUNT_AND_PECK) { wifi_station_unsupported(ctx, "saePwe", operation); goto done; }
#endif
    }
    *value = JS_GetPropertyStr(ctx, *root, "saeH2eIdentifier");
    if (JS_IsException(*value)) goto done;
    identifier_present = !JS_IsUndefined(*value);
    if (identifier_present) {
        JSCStringBuf buffer; size_t length;
        if (!JS_IsString(ctx, *value)) goto invalid;
        const char *text = JS_ToCStringLen(ctx, &length, *value, &buffer);
        if (text == NULL) goto done;
        if (length == 0 || length > sizeof(sta->sae_h2e_identifier) || memchr(text, 0, length) != NULL) goto invalid;
#if !CONFIG_ESP_WIFI_ENABLE_WPA3_SAE || !CONFIG_ESP_WIFI_ENABLE_SAE_H2E
        wifi_station_unsupported(ctx, "saeH2eIdentifier", operation); goto done;
#endif
        if (pwe_present && sta->sae_pwe_h2e == WPA3_SAE_PWE_HUNT_AND_PECK) goto conflict;
        if (!pwe_present) sta->sae_pwe_h2e = WPA3_SAE_PWE_BOTH;
        memcpy(sta->sae_h2e_identifier, text, length);
    }
    if ((pwe_present || identifier_present) &&
        (sta->password[0] == 0 || flag[4] ||
         strnlen((const char *)sta->password, sizeof(sta->password)) == sizeof(sta->password))) goto conflict;
    *value = JS_GetPropertyStr(ctx, *root, "saePkMode");
    if (JS_IsException(*value)) goto done;
    if (!JS_IsUndefined(*value)) {
        if (wifi_string_equals(ctx, *value, "automatic")) sta->sae_pk_mode = WPA3_SAE_PK_MODE_AUTOMATIC;
        else if (wifi_string_equals(ctx, *value, "only")) sta->sae_pk_mode = WPA3_SAE_PK_MODE_ONLY;
        else if (wifi_string_equals(ctx, *value, "disabled")) sta->sae_pk_mode = WPA3_SAE_PK_MODE_DISABLED;
        else goto invalid;
#if !CONFIG_ESP_WIFI_ENABLE_SAE_PK
        if (sta->sae_pk_mode != WPA3_SAE_PK_MODE_DISABLED) {
            wifi_station_unsupported(ctx, "saePkMode", operation); goto done;
        }
#endif
    }
    if (sta->sae_pk_mode == WPA3_SAE_PK_MODE_ONLY) {
        size_t password_length = strnlen((const char *)sta->password, sizeof(sta->password));
        if (password_length == 0 || password_length == sizeof(sta->password) || flag[4] ||
            (pwe_present && sta->sae_pwe_h2e == WPA3_SAE_PWE_HUNT_AND_PECK)) goto conflict;
        *value = JS_GetPropertyStr(ctx, *root, "minimumAuthMode");
        if (JS_IsException(*value)) goto done;
        if (!JS_IsUndefined(*value) && sta->threshold.authmode != WIFI_AUTH_WPA3_PSK) goto conflict;
        *value = JS_GetPropertyStr(ctx, *root, "pmf");
        if (JS_IsException(*value)) goto done;
        if (!JS_IsUndefined(*value) && !sta->pmf_cfg.required) goto conflict;
        /* PK-only is enforced on SAE handshakes by the native supplicant.
         * Exclude the WPA2 path, which would otherwise bypass that check. */
        sta->threshold.authmode = WIFI_AUTH_WPA3_PSK;
        sta->pmf_cfg.capable = true;
        sta->pmf_cfg.required = true;
        if (!pwe_present) sta->sae_pwe_h2e = WPA3_SAE_PWE_BOTH;
    }
    if (flag[4]) {
        if (sta->password[0] != 0) goto conflict;
        *value = JS_GetPropertyStr(ctx, *root, "minimumAuthMode");
        if (JS_IsException(*value)) goto done;
        if (!JS_IsUndefined(*value) && sta->threshold.authmode != WIFI_AUTH_OWE) goto conflict;
        *value = JS_GetPropertyStr(ctx, *root, "pmf");
        if (JS_IsException(*value)) goto done;
        if (!JS_IsUndefined(*value) && !sta->pmf_cfg.required) goto conflict;
        /* OWE selection must not fall back to an unencrypted open network. */
        sta->threshold.authmode = WIFI_AUTH_OWE;
        sta->pmf_cfg.capable = true;
        sta->pmf_cfg.required = true;
    }
#if !CONFIG_ESP_WIFI_ENABLE_WPA3_SAE
    if (sta->threshold.authmode == WIFI_AUTH_WPA3_PSK || sta->threshold.authmode == WIFI_AUTH_WPA2_WPA3_PSK) {
        wifi_station_unsupported(ctx, "minimumAuthMode", operation); goto done;
    }
#endif
#if !CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA
    if (sta->threshold.authmode == WIFI_AUTH_OWE) { wifi_station_unsupported(ctx, "minimumAuthMode", operation); goto done; }
#endif
#if !CONFIG_ESP_WIFI_WAPI_PSK
    if (sta->threshold.authmode == WIFI_AUTH_WAPI_PSK) { wifi_station_unsupported(ctx, "minimumAuthMode", operation); goto done; }
#endif
    ok = wifi_parse_station_phy(ctx, *root, sta, operation);
    goto done;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid wifi.connect station option");
    goto done;
conflict:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "conflicting wifi.connect station options");
done:
    JS_PopGCRef(ctx, &value_ref);
    JS_PopGCRef(ctx, &options_ref);
    return ok;
}

bool esp32_mquickjs_wifi_parse_station_config_for_operation(JSContext *ctx, int argc,
    JSGCRef *argv, wifi_config_t *config, uint32_t *timeout_ms, const char *operation)
{
    static const char *const allowed[] = {
        "password", "timeoutMs", "bssid", "channel", "scanMethod",
        "sortMethod", "minimumRssi", "minimumAuthMode", "pmf",
        "listenInterval", "failureRetryCount", "rmEnabled", "btmEnabled",
        "mboEnabled", "ftEnabled", "oweEnabled", "saePwe", "saeH2eIdentifier",
        "rssi5gAdjustment",
        "transitionDisable", "disableWpa3CompatibleMode", "saePkMode",
        "heDcmSet", "heDcmMaxConstellationTx", "heDcmMaxConstellationRx", "heMcs9Enabled",
        "heSuBeamformeeDisabled", "heTrigSuBeamformingFeedbackDisabled",
        "heTrigMuBeamformingPartialFeedbackDisabled", "heTrigCqiFeedbackDisabled",
        "vhtSuBeamformeeDisabled", "vhtMuBeamformeeDisabled", "vhtMcs8Enabled",
    };
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    JSCStringBuf ssid_buf;
    JSCStringBuf password_buf;
    const char *ssid;
    const char *password = "";
    size_t ssid_len = 0;
    size_t password_len = 0;
    int32_t integer;
    bool result = false;

    if (argc < 1 || argc > 2 || !JS_IsString(ctx, argv[0].val) ||
        (argc == 2 && !wifi_is_object(ctx, argv[1].val))) {
        JS_ThrowTypeError(
            ctx,
            "wifi.connect(ssid, options?) expects a string SSID and optional options object");
        goto done;
    }
    if (argc == 2 &&
        !wifi_validate_option_keys(ctx, argv[1].val, "wifi.connect()",
                                   allowed, sizeof(allowed) / sizeof(allowed[0]))) {
        goto done;
    }
    memset(config, 0, sizeof(*config));
    *timeout_ms = ESP32_MQUICKJS_WIFI_DEFAULT_TIMEOUT_MS;
    config->sta.scan_method = WIFI_ALL_CHANNEL_SCAN;
    config->sta.sort_method = WIFI_CONNECT_AP_BY_SIGNAL;
    config->sta.threshold.rssi = -127;
    config->sta.pmf_cfg.capable = true;

    ssid = JS_ToCStringLen(ctx, &ssid_len, argv[0].val, &ssid_buf);
    if (ssid == NULL || ssid_len == 0 || ssid_len > ESP32_MQUICKJS_WIFI_SSID_MAX_LEN ||
        memchr(ssid, 0, ssid_len) != NULL) {
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx,
                          "wifi.connect(ssid, ...) expects 1..%d bytes without NUL",
                          ESP32_MQUICKJS_WIFI_SSID_MAX_LEN);
        goto done;
    }
    memcpy(config->sta.ssid, ssid, ssid_len);
    config->sta.threshold.authmode = WIFI_AUTH_OPEN;
    if (argc == 1) {
        result = true;
        goto done;
    }

    *property = JS_GetPropertyStr(ctx, argv[1].val, "password");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        password = JS_IsString(ctx, *property)
                       ? JS_ToCStringLen(ctx, &password_len, *property,
                                         &password_buf)
                       : NULL;
        if (password == NULL ||
            password_len > ESP32_MQUICKJS_WIFI_PASSWORD_MAX_LEN ||
            memchr(password, 0, password_len) != NULL) {
            if (!JS_HasException(ctx)) JS_ThrowTypeError(
                ctx, "wifi.connect({ password }) expects at most %d bytes without NUL",
                ESP32_MQUICKJS_WIFI_PASSWORD_MAX_LEN);
            goto done;
        }
        if (password_len == sizeof(config->sta.password)) {
            for (size_t i = 0; i < password_len; ++i) {
                char c = password[i];
                if (!((c >= '0' && c <= '9') || (c >= 'a' && c <= 'f') || (c >= 'A' && c <= 'F'))) {
                    JS_ThrowTypeError(ctx, "wifi.connect 64-byte password must be a hexadecimal PSK");
                    goto done;
                }
            }
        }
        memcpy(config->sta.password, password, password_len);
    }
    config->sta.threshold.authmode =
        password_len > 0 ? WIFI_AUTH_WPA2_PSK : WIFI_AUTH_OPEN;

    *property = JS_GetPropertyStr(ctx, argv[1].val, "timeoutMs");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (!wifi_to_integer(ctx, *property, 1, INT32_MAX, &integer)) {
            if (!JS_HasException(ctx)) JS_ThrowRangeError(
                ctx, "wifi.connect({ timeoutMs }) expects 1..2147483647");
            goto done;
        }
        *timeout_ms = (uint32_t)integer;
    }

