99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_future.c
    *property = JS_GetPropertyStr(ctx, argv[1].val, "bssid");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (!wifi_parse_bssid(ctx, *property,
                              config->sta.bssid) || (config->sta.bssid[0] & 1U) != 0 ||
            memcmp(config->sta.bssid, (uint8_t[6]){0}, 6) == 0) {
            if (!JS_HasException(ctx)) JS_ThrowTypeError(
                ctx, "wifi.connect({ bssid }) expects xx:xx:xx:xx:xx:xx");
            goto done;
        }
        config->sta.bssid_set = true;
    }

    *property = JS_GetPropertyStr(ctx, argv[1].val, "channel");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (!wifi_to_integer(ctx, *property, 0, 177, &integer) ||
            (integer > 13 &&
#if CONFIG_SOC_WIFI_SUPPORT_5G
             esp32_mquickjs_wifi_radio_5ghz_channel_bit((uint8_t)integer) == 0
#else
             true
#endif
            )) {
            if (!JS_HasException(ctx)) JS_ThrowRangeError(
                ctx, "wifi.connect({ channel }) expects 0 or a target-supported channel hint");
            goto done;
        }
        config->sta.channel = (uint8_t)integer;
    }

    *property = JS_GetPropertyStr(ctx, argv[1].val, "scanMethod");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (wifi_string_equals(ctx, *property, "fast")) {
            config->sta.scan_method = WIFI_FAST_SCAN;
        } else if (wifi_string_equals(ctx, *property, "all-channel")) {
            config->sta.scan_method = WIFI_ALL_CHANNEL_SCAN;
        } else {
            if (!JS_HasException(ctx)) JS_ThrowRangeError(
                ctx, "wifi.connect({ scanMethod }) expects fast or all-channel");
            goto done;
        }
    }

    *property = JS_GetPropertyStr(ctx, argv[1].val, "sortMethod");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (wifi_string_equals(ctx, *property, "signal")) {
            config->sta.sort_method = WIFI_CONNECT_AP_BY_SIGNAL;
        } else if (wifi_string_equals(ctx, *property, "security")) {
            config->sta.sort_method = WIFI_CONNECT_AP_BY_SECURITY;
        } else {
            if (!JS_HasException(ctx)) JS_ThrowRangeError(
                ctx, "wifi.connect({ sortMethod }) expects signal or security");
            goto done;
        }
    }

    *property = JS_GetPropertyStr(ctx, argv[1].val, "minimumRssi");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (!wifi_to_integer(ctx, *property, -127, 0, &integer)) {
            if (!JS_HasException(ctx)) JS_ThrowRangeError(
                ctx, "wifi.connect({ minimumRssi }) expects -127..0");
            goto done;
        }
        config->sta.threshold.rssi = (int8_t)integer;
    }

    *property = JS_GetPropertyStr(ctx, argv[1].val, "minimumAuthMode");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property) &&
        !wifi_parse_auth_mode(
            ctx, *property, &config->sta.threshold.authmode)) {
        if (!JS_HasException(ctx)) JS_ThrowRangeError(
            ctx, "wifi.connect({ minimumAuthMode }) is not a supported personal auth mode");
        goto done;
    }

    config->sta.pmf_cfg.required = config->sta.threshold.authmode == WIFI_AUTH_WPA3_PSK ||
        config->sta.threshold.authmode == WIFI_AUTH_OWE;
    *property = JS_GetPropertyStr(ctx, argv[1].val, "pmf");
    if (JS_IsException(*property)) {
        goto done;
    }
    if (!JS_IsUndefined(*property)) {
        if (wifi_string_equals(ctx, *property, "disabled")) {
            config->sta.pmf_cfg.capable = false;
            config->sta.pmf_cfg.required = false;
        } else if (wifi_string_equals(ctx, *property, "optional")) {
            config->sta.pmf_cfg.capable = true;
            config->sta.pmf_cfg.required = false;
        } else if (wifi_string_equals(ctx, *property, "required")) {
            config->sta.pmf_cfg.capable = true;
            config->sta.pmf_cfg.required = true;
        } else {
            if (!JS_HasException(ctx)) JS_ThrowRangeError(
                ctx, "%s({ pmf }) expects disabled, optional or required", operation);
            goto done;
        }
    }
    result = wifi_parse_station_extensions(ctx, argv[1].val, &config->sta, operation);
    if (result && (config->sta.threshold.authmode == WIFI_AUTH_WPA3_PSK ||
        config->sta.threshold.authmode == WIFI_AUTH_OWE) && !config->sta.pmf_cfg.required) {
        JS_ThrowTypeError(ctx, "Station authentication requires PMF");
        result = false;
    }
    if (result && !config->sta.pmf_cfg.capable &&
        !esp32_mquickjs_wifi_radio_pmf_disable_allowed(WIFI_IF_STA, config)) {
        JS_ThrowTypeError(ctx, "PMF disabled conflicts with Station authentication or WPA3 compatible policy");
        result = false;
    }

done:
    if (!result) esp32_mquickjs_wireless_secure_zero(config, sizeof(*config));
    esp32_mquickjs_wireless_secure_zero(&ssid_buf, sizeof(ssid_buf));
    esp32_mquickjs_wireless_secure_zero(&password_buf, sizeof(password_buf));
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

bool esp32_mquickjs_wifi_parse_station_config(JSContext *ctx, int argc,
    JSGCRef *argv, wifi_config_t *config, uint32_t *timeout_ms)
{
    return esp32_mquickjs_wifi_parse_station_config_for_operation(ctx, argc, argv,
        config, timeout_ms, "wifi.connect");
}

static bool wifi_future_parse_connect(JSContext *ctx, int argc, JSGCRef *argv,
                                      esp32_mquickjs_future_driver_state_t *state)
{
    return esp32_mquickjs_wifi_parse_connect_config(ctx, argc, argv,
        &state->connect_config, &state->timeout_ms);
}

static bool wifi_scan_parse_channels(JSContext *ctx, JSValue input, wifi_scan_channel_bitmap_t *bitmap)
{
    static const char *const keys[] = {"ghz2", "ghz5"};
    JSGCRef object_ref, array_ref, item_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    *object = input;
    uint32_t bits[2] = {1U, 1U}; /* Omitted band is bypassed, never scanned in full. */
    bool ok = false;
    if (!wifi_validate_option_keys(ctx, *object, "wifi.scan channels", keys, 2)) goto done;
    for (size_t band = 0; band < 2; ++band) {
        *array = JS_GetPropertyStr(ctx, *object, keys[band]);
        if (JS_IsException(*array)) goto done;
        if (JS_IsUndefined(*array)) continue;
#if !CONFIG_SOC_WIFI_SUPPORT_5G
        if (band == 1) {
            JS_ThrowTypeError(ctx, "wifi.scan channels.ghz5 is unsupported on this target");
            goto done;
        }
#endif
        if (!JS_IsArray(ctx, *array)) goto invalid;
        *item = JS_GetPropertyStr(ctx, *array, "length");
        if (JS_IsException(*item)) goto done;
        int32_t length;
        if (!wifi_to_integer(ctx, *item, 1, band == 0 ? 14 : 28, &length)) goto invalid;
        bits[band] = 0;
        for (int32_t i = 0; i < length; ++i) {
            *item = JS_GetPropertyUint32(ctx, *array, i);
            if (JS_IsException(*item)) goto done;
            int32_t channel;
            if (!wifi_to_integer(ctx, *item, 1, band == 0 ? 14 : 177, &channel)) goto invalid;
            uint32_t bit = band == 0 ? 1UL << channel :
                esp32_mquickjs_wifi_radio_5ghz_channel_bit((uint8_t)channel);
            if (bit == 0 || (bits[band] & bit) != 0) goto invalid;
            bits[band] |= bit;
        }
    }
    if (bits[0] == 1U && bits[1] == 1U) goto invalid;
    bitmap->ghz_2_channels = bits[0];
    bitmap->ghz_5_channels = bits[1];
    ok = true;
    goto done;
invalid:
    JS_ThrowTypeError(ctx, "wifi.scan channels requires nonempty arrays of distinct valid channel numbers");
done:
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    JS_PopGCRef(ctx, &object_ref);
    return ok;
}

static bool wifi_scan_future_prepare(JSContext *ctx,
                                     JSGCRef *this_ref,
                                     int argc,
                                     JSGCRef *argv,
                                     esp32_mquickjs_future_driver_state_t **out_state)
{
    static const char *const allowed[] = {
        "channel", "showHidden", "mode", "activeMinMs", "activeMaxMs", "passiveMs", "timeoutMs",
        "ssid", "bssid", "homeChannelDwellMs", "coexistenceBackgroundScan", "maxRecords",
        "channels",
    };
    esp32_mquickjs_future_driver_state_t *state;
    wifi_scan_config_t scan_config = {
        .show_hidden = true,
        .scan_type = WIFI_SCAN_TYPE_ACTIVE,
        .scan_time = {
            .active = {.min = WIFI_ACTIVE_SCAN_MIN_DEFAULT_TIME, .max = WIFI_ACTIVE_SCAN_MAX_DEFAULT_TIME},
            .passive = WIFI_PASSIVE_SCAN_DEFAULT_TIME,
        },
        .home_chan_dwell_time = 30,
    };
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    int32_t integer;
    bool active_time_supplied = false;
    bool passive_time_supplied = false;
    bool result = false;

    (void)this_ref;
    if (out_state == NULL || argc < 0 || argc > 1 ||
        (argc == 1 && !wifi_is_object(ctx, argv[0].val))) {
        JS_ThrowTypeError(ctx, "wifi.scan(options?) expects an options object");
        goto done;
    }
    if (argc == 1 &&
        !wifi_validate_option_keys(ctx, argv[0].val, "wifi.scan()",
                                   allowed, sizeof(allowed) / sizeof(*allowed))) {
        goto done;
    }
    state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto done;
    }
    state->kind = WIFI_FUTURE_SCAN;
    state->timeout_ms = ESP32_MQUICKJS_WIFI_DEFAULT_TIMEOUT_MS;
    state->scan_max_records = ESP32_MQUICKJS_WIFI_MAX_SCAN_RECORDS;
    if (argc == 1) {
        *property = JS_GetPropertyStr(ctx, argv[0].val, "ssid");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            JSCStringBuf buffer;
            size_t length;
            const char *text;
            if (!JS_IsString(ctx, *property)) {
                JS_ThrowTypeError(ctx, "wifi.scan({ ssid }) expects a string");
                goto fail;
            }
            text = JS_ToCStringLen(ctx, &length, *property, &buffer);
            if (text == NULL) goto fail;
            if (length == 0 || length > 32 || memchr(text, 0, length) != NULL) {
                JS_ThrowRangeError(ctx, "wifi.scan({ ssid }) expects 1..32 UTF-8 bytes without NUL");
                goto fail;
            }
            memcpy(state->scan_ssid, text, length);
            scan_config.ssid = state->scan_ssid;
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "bssid");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (!wifi_parse_bssid(ctx, *property, state->scan_bssid) ||
                (state->scan_bssid[0] & 1U) != 0U ||
                memcmp(state->scan_bssid, "\0\0\0\0\0\0", 6) == 0) {
                JS_ThrowTypeError(ctx, "wifi.scan({ bssid }) expects a nonzero unicast MAC (xx:xx:xx:xx:xx:xx)");
                goto fail;
            }
            scan_config.bssid = state->scan_bssid;
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "homeChannelDwellMs");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (!wifi_to_integer(ctx, *property, 30, 150, &integer)) {
                JS_ThrowRangeError(ctx, "wifi.scan({ homeChannelDwellMs }) expects 30..150");
                goto fail;
            }
            scan_config.home_chan_dwell_time = (uint8_t)integer;
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "coexistenceBackgroundScan");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (!JS_IsBool(*property)) {
                JS_ThrowTypeError(ctx, "wifi.scan({ coexistenceBackgroundScan }) expects a boolean");
                goto fail;
            }
            scan_config.coex_background_scan = *property == JS_TRUE;
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "maxRecords");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (!wifi_to_integer(ctx, *property, 1, ESP32_MQUICKJS_WIFI_MAX_SCAN_RECORDS, &integer)) {
                JS_ThrowRangeError(ctx, "wifi.scan({ maxRecords }) expects 1..32");
                goto fail;
            }
            state->scan_max_records = (uint16_t)integer;
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "channel");
        if (JS_IsException(*property)) {
            goto fail;
        }
        if (!JS_IsUndefined(*property) && !wifi_string_equals(ctx, *property, "all")) {
            if (!wifi_to_integer(ctx, *property, 1, 255, &integer)) {
                JS_ThrowRangeError(
                    ctx, "wifi.scan({ channel }) expects all or 1..255");
                goto fail;
            }
            scan_config.channel = (uint8_t)integer;
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "channels");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (scan_config.channel != 0) {
                JS_ThrowTypeError(ctx, "wifi.scan channel number and channels are mutually exclusive");
                goto fail;
            }
            if (!wifi_scan_parse_channels(ctx, *property, &scan_config.channel_bitmap)) goto fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "showHidden");
        if (JS_IsException(*property)) {
            goto fail;
        }
        if (!JS_IsUndefined(*property)) {
            if (!JS_IsBool(*property)) {
                JS_ThrowTypeError(
                    ctx, "wifi.scan({ showHidden }) expects a boolean");
                goto fail;
            }
            scan_config.show_hidden = *property == JS_TRUE;
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "mode");
        if (JS_IsException(*property)) {
            goto fail;
        }
        if (!JS_IsUndefined(*property)) {
            if (wifi_string_equals(ctx, *property, "active")) {
                scan_config.scan_type = WIFI_SCAN_TYPE_ACTIVE;
            } else if (wifi_string_equals(ctx, *property, "passive")) {
                scan_config.scan_type = WIFI_SCAN_TYPE_PASSIVE;
            } else {
                JS_ThrowTypeError(ctx, "wifi.scan({ mode }) expects active or passive");
                goto fail;
            }
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "activeMinMs");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (!wifi_to_integer(ctx, *property, 0, 1500, &integer)) {
                JS_ThrowRangeError(ctx, "wifi.scan({ activeMinMs }) expects 0..1500");
                goto fail;
            }
            scan_config.scan_time.active.min = (uint32_t)integer;
            active_time_supplied = true;
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "activeMaxMs");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (!wifi_to_integer(ctx, *property, 1, 1500, &integer)) {
                JS_ThrowRangeError(ctx, "wifi.scan({ activeMaxMs }) expects 1..1500");
                goto fail;
            }
            scan_config.scan_time.active.max = (uint32_t)integer;
            active_time_supplied = true;
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "passiveMs");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (!wifi_to_integer(ctx, *property, 1, 1500, &integer)) {
                JS_ThrowRangeError(ctx, "wifi.scan({ passiveMs }) expects 1..1500");
                goto fail;
            }
            scan_config.scan_time.passive = (uint32_t)integer;
            passive_time_supplied = true;
        }
        if (scan_config.scan_time.active.min > scan_config.scan_time.active.max) {
            JS_ThrowRangeError(ctx, "wifi.scan activeMinMs must not exceed activeMaxMs");
            goto fail;
        }
        if ((scan_config.scan_type == WIFI_SCAN_TYPE_ACTIVE && passive_time_supplied) ||
            (scan_config.scan_type == WIFI_SCAN_TYPE_PASSIVE && active_time_supplied)) {
            JS_ThrowTypeError(ctx, "wifi.scan timing fields must match mode");
            goto fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0].val, "timeoutMs");
        if (JS_IsException(*property)) {
            goto fail;
        }
        if (!JS_IsUndefined(*property)) {
            if (!wifi_to_integer(ctx, *property, 1, INT32_MAX, &integer)) {
                JS_ThrowRangeError(
                    ctx, "wifi.scan({ timeoutMs }) expects 1..2147483647");
                goto fail;
            }
            state->timeout_ms = (uint32_t)integer;
        }
    }
    state->scan_config = scan_config;
    *out_state = state;
    result = true;
    goto done;

