99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_future.c
fail:
    esp32_mquickjs_memory_payload_free(state);
done:
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

static bool wifi_connect_future_prepare(JSContext *ctx,
                                        JSGCRef *this_ref,
                                        int argc,
                                        JSGCRef *argv,
                                        esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;

    (void)this_ref;
    if (out_state == NULL) {
        return false;
    }
    state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->kind = WIFI_FUTURE_CONNECT;
    if (!wifi_future_parse_connect(ctx, argc, argv, state)) {
        esp32_mquickjs_wireless_secure_zero(
            &state->connect_config, sizeof(state->connect_config));
        esp32_mquickjs_memory_payload_free(state);
        return false;
    }
    *out_state = state;
    return true;
}

static bool wifi_disconnect_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;

    (void)this_ref;
    if (out_state == NULL || argc < 0 || argc > 1) {
        JS_ThrowTypeError(
            ctx, "wifi.disconnect(options?) expects at most one argument");
        return false;
    }
    uint32_t timeout_ms;
    if (!esp32_mquickjs_wifi_capture_disconnect(ctx, argc ? argv[0].val : JS_UNDEFINED, &timeout_ms)) return false;
    state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->kind = WIFI_FUTURE_DISCONNECT;
    state->timeout_ms = timeout_ms;
    *out_state = state;
    return true;
}

static bool wifi_future_start(JSContext *ctx,
                              esp32_mquickjs_runtime_t *runtime,
                              esp32_mquickjs_future_token_t token,
                              esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_wifi_state_t *wifi = esp32_mquickjs_wifi_state();
    esp_err_t err;
    bool disconnect_pending = false;

    if (state == NULL) {
        JS_ThrowInternalError(ctx, "Wi-Fi Future lost its driver state");
        return false;
    }
    if (state->kind == WIFI_FUTURE_DISCONNECT &&
        (!wifi->initialized || !wifi->started)) {
        state->connect_kind =
            ESP32_MQUICKJS_WIFI_CONNECT_EVENT_KIND_DISCONNECTED;
        state->completed = true;
        state->started = true;
        return true;
    }
    if (state->kind == WIFI_FUTURE_CONNECT) {
        /* Reject an exhausted identity before preparation can disconnect an
         * established Station. Registration rechecks after the handoff. */
        esp32_mquickjs_wifi_lock();
        bool exhausted = wifi->connect_generation == UINT32_MAX;
        esp32_mquickjs_wifi_unlock();
        if (exhausted) {
            esp32_mquickjs_wifi_throw_operation_error(ctx, "WIFI_OPERATION_BUSY",
                "wifi.connect", ESP_ERR_INVALID_STATE, -1, UINT32_MAX);
            return false;
        }
    }
    /* A disabled-PMF connect must configure while stopped. This may retire
     * and recreate the helper, so do it before publishing the Future token. */
    err = state->kind == WIFI_FUTURE_CONNECT
        ? esp32_mquickjs_wifi_prepare_connect(&state->connect_config)
        : esp32_mquickjs_wifi_ensure_started();
    if (err != ESP_OK) {
        if (state->kind == WIFI_FUTURE_SCAN) {
            esp32_mquickjs_wifi_throw_scan_error(ctx, err);
        } else {
            esp32_mquickjs_wifi_throw_connect_error(ctx, err);
        }
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    (void)esp32_mquickjs_wifi_drain_scan();

    esp32_mquickjs_wifi_lock();
    if (state->kind == WIFI_FUTURE_SCAN) {
        if (wifi->scan_in_progress || wifi->scan_future_registered ||
            wifi->scan_draining || wifi->scan_results_pending ||
            wifi->scan_stop_active || wifi->connect_in_progress || wifi->connect_draining ||
            esp32_mquickjs_wifi_connection_reserved_locked() || wifi->scan_generation == UINT32_MAX) {
            esp32_mquickjs_wifi_unlock();
            esp32_mquickjs_wifi_throw_operation_error(
                ctx, "WIFI_SCAN_BUSY", "wifi.scan", ESP_ERR_INVALID_STATE,
                -1, UINT32_MAX);
            return false;
        }
        wifi->scan_generation++;
        state->generation = wifi->scan_generation;
        wifi->scan_future_registered = true;
        wifi->scan_future_token = token;
    } else {
        if (esp32_mquickjs_wifi_connection_reserved_locked() || wifi->connect_generation == UINT32_MAX ||
            (state->kind == WIFI_FUTURE_CONNECT &&
             (wifi->connect_in_progress || wifi->scan_in_progress || wifi->scan_future_registered ||
              wifi->scan_draining || wifi->scan_results_pending || wifi->scan_stop_active))) {
            esp32_mquickjs_wifi_unlock();
            esp32_mquickjs_wifi_throw_operation_error(
                ctx, "WIFI_OPERATION_BUSY",
                wifi_future_operation_name(state->kind),
                ESP_ERR_INVALID_STATE, -1, UINT32_MAX);
            return false;
        }
        wifi->connect_generation++;
        state->generation = wifi->connect_generation;
        wifi->connect_future_registered = true;
        wifi->connect_future_token = token;
        wifi->connection_future_operation =
            state->kind == WIFI_FUTURE_CONNECT
                ? ESP32_MQUICKJS_WIFI_OPERATION_CONNECT
                : ESP32_MQUICKJS_WIFI_OPERATION_DISCONNECT;
    }
    esp32_mquickjs_wifi_unlock();

    if (state->kind == WIFI_FUTURE_SCAN) {
        if (wifi->scan_queue != NULL) {
            xQueueReset(wifi->scan_queue);
        }
        err = esp32_mquickjs_wifi_start_scan(&state->scan_config, state->generation);
        if (err != ESP_OK) {
            esp32_mquickjs_wifi_clear_scan_future();
            esp32_mquickjs_wifi_throw_scan_error(ctx, err);
            return false;
        }
    } else if (state->kind == WIFI_FUTURE_CONNECT) {
        state->connect_start_us = esp_timer_get_time();
        err = esp32_mquickjs_wifi_start_connect(&state->connect_config,
                                                state->timeout_ms);
        if (err != ESP_OK) {
            esp32_mquickjs_wifi_clear_connect_future();
            esp32_mquickjs_wifi_throw_connect_error(ctx, err);
            return false;
        }
    } else {
        if (wifi->connect_queue != NULL) {
            xQueueReset(wifi->connect_queue);
        }
        err = esp32_mquickjs_wifi_start_disconnect(&disconnect_pending);
        if (err != ESP_OK) {
            esp32_mquickjs_wifi_clear_connect_future();
            esp32_mquickjs_wifi_throw_operation_error(
                ctx, "WIFI_DISCONNECT_FAILED", "wifi.disconnect", err,
                -1, UINT32_MAX);
            return false;
        }
        if (!disconnect_pending) {
            state->connect_kind =
                ESP32_MQUICKJS_WIFI_CONNECT_EVENT_KIND_DISCONNECTED;
            state->completed = true;
        }
    }
    state->started = true;
    return true;
}

static esp32_mquickjs_future_poll_t wifi_future_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_wifi_state_t *wifi = esp32_mquickjs_wifi_state();

    if (state == NULL) {
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    if (state->completed) {
        return ESP32_MQUICKJS_FUTURE_READY;
    }
    if (state->kind == WIFI_FUTURE_SCAN) {
        esp32_mquickjs_wifi_scan_event_t event;

        while (wifi->scan_queue != NULL && xQueueReceive(wifi->scan_queue, &event, 0) == pdTRUE) {
            if (event.generation == state->generation) {
                state->scan_status = event.status;
                state->completed = true;
                break;
            }
        }
    } else {
        esp32_mquickjs_wifi_connect_event_t event;

        while (wifi->connect_queue != NULL &&
               xQueueReceive(wifi->connect_queue, &event, 0) == pdTRUE) {
            if (event.generation == state->generation) {
                state->connect_kind = event.kind;
                state->connect_reason = event.reason;
                state->connect_completed_us = event.completed_us;
                state->connect_link = event.link;
                state->completed = true;
                break;
            }
        }
    }
    return state->completed
        ? ESP32_MQUICKJS_FUTURE_READY
        : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue wifi_scan_future_result(JSContext *ctx,
    esp32_mquickjs_future_driver_state_t *state, bool timed_out)
{
    JSGCRef records_ref, result_ref;
    JSValue *records = JS_PushGCRef(ctx, &records_ref);
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_UNDEFINED;
    *records = state->started
        ? esp32_mquickjs_wifi_make_scan_results_array(ctx, state->scan_max_records)
        : JS_NewArray(ctx, 0);
    /* Reading the SDK list and native retirement are distinct. A delayed
     * SCAN_DONE keeps the native lane isolated after this Future returns. */
    esp_err_t err = state->started ? esp32_mquickjs_wifi_cancel_scan(state->generation) : ESP_OK;
    state->completed = true;
    if (JS_IsException(*records)) goto fail;
    if (err != ESP_OK) {
        esp32_mquickjs_wifi_throw_scan_error(ctx, err);
        goto fail;
    }
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "records", *records) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "complete", JS_NewBool(!timed_out)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "timedOut", JS_NewBool(timed_out))) goto fail;
    JSValue value = JS_PopGCRef(ctx, &result_ref);
    JS_PopGCRef(ctx, &records_ref);
    return value;
fail:
    JS_PopGCRef(ctx, &result_ref);
    JS_PopGCRef(ctx, &records_ref);
    return JS_EXCEPTION;
}

static JSValue wifi_future_finish(JSContext *ctx,
                                  esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->cancel_requested) {
        return esp32_mquickjs_wifi_throw_operation_error(
            ctx, "WIFI_CANCELLED",
            state != NULL ? wifi_future_operation_name(state->kind)
                          : "wifi",
            ESP_ERR_INVALID_STATE, -1, UINT32_MAX);
    }
    if (state->kind == WIFI_FUTURE_SCAN) {
        if (state->scan_status != 0) {
            (void)esp32_mquickjs_wifi_cancel_scan(state->generation);
            return esp32_mquickjs_wifi_throw_operation_error(
                ctx, "WIFI_SCAN_FAILED", "wifi.scan", ESP_FAIL, -1,
                state->scan_status);
        }
        return wifi_scan_future_result(ctx, state, false);
    }
    esp32_mquickjs_wifi_clear_connect_future();
    if (state->kind == WIFI_FUTURE_DISCONNECT) {
        if (state->connect_kind ==
            ESP32_MQUICKJS_WIFI_CONNECT_EVENT_KIND_DISCONNECTED) {
            return esp32_mquickjs_wifi_make_status_object(ctx);
        }
        return esp32_mquickjs_wifi_throw_operation_error(
            ctx, "WIFI_DISCONNECT_FAILED", "wifi.disconnect",
            ESP_ERR_INVALID_STATE, state->connect_reason, UINT32_MAX);
    }
    if (state->connect_kind == ESP32_MQUICKJS_WIFI_CONNECT_EVENT_KIND_SUCCESS) {
        double elapsed_ms = state->connect_completed_us >= state->connect_start_us
            ? (double)(state->connect_completed_us - state->connect_start_us) / 1000.0 : 0;
        return esp32_mquickjs_wifi_make_connect_result(ctx, &state->connect_link, elapsed_ms);
    }
    if (state->connect_kind == ESP32_MQUICKJS_WIFI_CONNECT_EVENT_KIND_TIMEOUT) {
        return esp32_mquickjs_wifi_throw_operation_error(
            ctx, "WIFI_CONNECT_TIMEOUT", "wifi.connect", ESP_ERR_TIMEOUT,
            state->connect_reason, UINT32_MAX);
    }
    return esp32_mquickjs_wifi_throw_operation_error(
        ctx, "WIFI_CONNECT_FAILED", "wifi.connect", ESP_FAIL,
        state->connect_reason, UINT32_MAX);
}

static JSValue wifi_scan_future_on_timeout(JSContext *ctx,
    esp32_mquickjs_future_driver_state_t *state, uint32_t timeout_ms)
{
    (void)timeout_ms;
    if (state == NULL || state->cancel_requested) return wifi_future_finish(ctx, state);
    /* A completion already published for this generation wins the race with
     * the deadline. A queued-but-unstarted scan must not read another AP list. */
    if (state->started) {
        if (wifi_future_poll(state) == ESP32_MQUICKJS_FUTURE_READY)
            return wifi_future_finish(ctx, state);
        esp_err_t err = esp32_mquickjs_wifi_stop_scan_for_results(state->generation);
        if (err != ESP_OK) return esp32_mquickjs_wifi_throw_scan_error(ctx, err);
    }
    return wifi_scan_future_result(ctx, state, true);
}

static esp32_mquickjs_cancel_result_t wifi_future_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->completed || state->cancel_requested) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    state->cancel_requested = true;
    if (state->kind == WIFI_FUTURE_DISCONNECT && state->started) {
        state->cancel_requested = false;
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    if (state->kind == WIFI_FUTURE_SCAN) {
        if (state->started)
            (void)esp32_mquickjs_wifi_cancel_scan(state->generation);
    } else if (state->started) {
        (void)esp32_mquickjs_wifi_cancel_connect(state->generation);
    }
    state->completed = true;
    if (state->runtime != NULL)
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    return ESP32_MQUICKJS_CANCELLED;
}

static void wifi_future_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return;
    }
    if (state->started && state->kind == WIFI_FUTURE_SCAN) {
        /* A completed-but-unread scan still owns the driver's AP list. */
        (void)esp32_mquickjs_wifi_cancel_scan(state->generation);
    } else if (state->started && !state->completed) {
        if (state->kind == WIFI_FUTURE_DISCONNECT) {
            /*
             * esp_wifi_disconnect() cannot be rolled back once submitted.  The
             * Future may still be destroyed during runtime teardown, though,
             * so detach its generation/token before releasing the driver
             * state.  A later STA_DISCONNECTED event will then update Wi-Fi
             * status without waking a stale Future token.
             */
            esp32_mquickjs_wifi_clear_connect_future();
        } else {
            (void)wifi_future_cancel(state);
        }
    }
    esp32_mquickjs_wireless_secure_zero(
        &state->connect_config, sizeof(state->connect_config));
    esp32_mquickjs_memory_payload_free(state);
}

static uint32_t wifi_future_timeout_ms(
    const esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) {
        return 0;
    }
    return state->timeout_ms;
}

static const esp32_mquickjs_future_driver_t s_wifi_scan_future_driver = {
    .memory_owner = "wireless.future", .capture = wifi_scan_future_prepare,
    .start = wifi_future_start,
    .poll = wifi_future_poll,
    .finish = wifi_future_finish,
    .cancel = wifi_future_cancel,
    .destroy = wifi_future_destroy,
    .timeout_ms = wifi_future_timeout_ms,
    .on_timeout = wifi_scan_future_on_timeout,
};

